Revit 2027 API
AnalyticalLink.EndHubId Property
 Hub ID at end of AnalyticalLink.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId EndHubId { get; }
Public ReadOnly Property EndHubId As ElementId
	Get
public:
property ElementId^ EndHubId {
	ElementId^ get ();
}
member EndHubId : ElementId with get
Property Value
ElementId
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace